In [ ]:
"""
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series
"""

In [1]:
#Ans 1:
import pandas as pd

In [2]:
df = pd.Series([4,8,15,16,23,42])

In [4]:
df
type(df)

pandas.core.series.Series

In [6]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
"""
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it.
"""

In [7]:
#Ans 2:
my_list = [i for i in range(10)]

In [8]:
my_list

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [10]:
df1 = pd.Series(my_list)
df1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [11]:
type(df1)

pandas.core.series.Series

In [ ]:
"""
Q3. Create a Pandas DataFrame that contains the following data and print the data frame
"""

In [12]:
#Ans 3:
name_list = ["Alice" , "Bob" , "Claire"]
age_list = [25 , 30 , 27]
gender_list = ["Female" , "Male" , "Female"]

df2 = pd.DataFrame({"Name":name_list , "Age":age_list , "Gender":gender_list})

In [13]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
"""
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
"""

In [ ]:
"""
Ans 4:
In pandas, a DataFrame is a two-dimensional data structure that represents tabular data in a flexible and powerful way. It can be thought of as a
collection of pandas Series objects, where each Series represents a column of the DataFrame. In other words, a DataFrame is a container for multiple 
Series.

A pandas Series, on the other hand, is a one-dimensional labeled array that can hold any data type. It is similar to a column in a spreadsheet or 
a database table. Each element in a Series has a unique label, which is its index.

The example is as follows:
"""

In [14]:
# Creating a Series
series_data = pd.Series([10, 20, 30, 40, 50], name='Numbers')

# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45],
    'Salary': [50000, 60000, 70000, 80000, 90000]
}
df = pd.DataFrame(data)

print("Series:")
print(series_data)
print("Type of series_data:", type(series_data))
print()

print("DataFrame:")
print(df)
print("Type of df:", type(df))

Series:
0    10
1    20
2    30
3    40
4    50
Name: Numbers, dtype: int64
Type of series_data: <class 'pandas.core.series.Series'>

DataFrame:
      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000
4      Eve   45   90000
Type of df: <class 'pandas.core.frame.DataFrame'>

In [15]:
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000
4      Eve   45   90000

In [ ]:
"""
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?
"""

In [ ]:
"""
Ans 5: Some common functions that I have learned to manipulate data are:

1.head() --> By default it gives the first 5 rows of DataFrame. If we need more rows from the top we can add the number of rows in the parenthesis.
2.tail() --> By default it gives the last 5 rows of DataFrame. If we need more rows from the bottom we can add the number of rows in the parenthesis.
3.to_csv() --> Used to save a DataFrame in csv file.
4.columns --> To get the column names present in the dataframe.
5.dtypes --> to identify the data type of the columns.

For example say I want the column names from the data frame of the above example. Then we use columns function. Below is the code.
"""

In [27]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

In [ ]:
"""
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
"""

In [ ]:
"""
Ans 6:

In pandas, the Series and DataFrame objects are mutable, meaning their values can be modified after they are created. However, the Panel object is
not mutable.

Series and DataFrame objects can be modified by assigning new values to specific elements, adding or removing columns, or performing various 
operations that change the data within them.
On the other hand, the Panel object, which represents three-dimensional data, has been deprecated in recent versions of pandas. It is recommended to
use other data structures, such as multi-index DataFrames or xarray, for handling three-dimensional data.

In summary, Series and DataFrame objects in pandas are mutable, while the Panel object is not relevant for current versions of pandas.
"""

In [ ]:
"""
Q7. Create a DataFrame using multiple Series. Explain with an example.
"""

In [29]:
#Ans 7:
import pandas as pd

#Creating Multiple Series
name_list = pd.Series(["Alice" , "Bob" , "Claire"])
age_list = pd.Series([25 , 30 , 27])
gender_list = pd.Series(["Female" , "Male" , "Female"])

data = {"Name":name_list ,
        "Age":age_list , 
        "Gender":gender_list}

#Adding the multiple Series in a DataFrame
df5 = pd.DataFrame(data)

In [30]:
df5

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female